riccardoziani/mke02/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PTD1 (number 1), Zero_X_Comp
  @{ */
#define BOARD_INITPINS_Zero_X_Comp_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_Zero_X_Comp_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_Zero_X_Comp_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_Zero_X_Comp_GPIO_PIN 25U                       /*!<@brief PORTA pin index: 25 */
#define BOARD_INITPINS_Zero_X_Comp_PORT PORTD                         /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_Zero_X_Comp_PIN 1U                             /*!<@brief PORTD pin index: 1 */
#define BOARD_INITPINS_Zero_X_Comp_CHANNEL 25                         /*!<@brief GPIOA GPIO channel: 25 */
#define BOARD_INITPINS_Zero_X_Comp_PIN_NAME PTD1                      /*!<@brief Pin name */
#define BOARD_INITPINS_Zero_X_Comp_LABEL "Zero_X_Comp"                /*!<@brief Label */
#define BOARD_INITPINS_Zero_X_Comp_NAME "Zero_X_Comp"                 /*!<@brief Identifier name */
#define BOARD_INITPINS_Zero_X_Comp_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                      /* @} */

/*! @name FTM2_CH2 (number 2), U_Z_Cross
  @{ */
#define BOARD_INITPINS_U_Z_Cross_PERIPHERAL FTM2                   /*!<@brief Device name: FTM2 */
#define BOARD_INITPINS_U_Z_Cross_SIGNAL CH                         /*!<@brief FTM2 signal: CH */
#define BOARD_INITPINS_U_Z_Cross_CHANNEL 2                         /*!<@brief FTM2 channel: 2 */
#define BOARD_INITPINS_U_Z_Cross_PIN_NAME FTM2_CH2                 /*!<@brief Pin name */
#define BOARD_INITPINS_U_Z_Cross_LABEL "U_Z_Cross"                 /*!<@brief Label */
#define BOARD_INITPINS_U_Z_Cross_NAME "U_Z_Cross"                  /*!<@brief Identifier name */
#define BOARD_INITPINS_U_Z_Cross_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                   /* @} */

/*! @name PTE7 (number 3), U_Led_Debug_2
  @{ */
#define BOARD_INITPINS_U_Led_Debug_2_PERIPHERAL GPIOB                   /*!<@brief Device name: GPIOB */
#define BOARD_INITPINS_U_Led_Debug_2_SIGNAL GPIO                        /*!<@brief GPIOB signal: GPIO */
#define BOARD_INITPINS_U_Led_Debug_2_GPIO GPIOB                         /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_U_Led_Debug_2_GPIO_PIN 7U                        /*!<@brief PORTB pin index: 7 */
#define BOARD_INITPINS_U_Led_Debug_2_PORT PORTE                         /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_U_Led_Debug_2_PIN 7U                             /*!<@brief PORTE pin index: 7 */
#define BOARD_INITPINS_U_Led_Debug_2_CHANNEL 7                          /*!<@brief GPIOB GPIO channel: 7 */
#define BOARD_INITPINS_U_Led_Debug_2_PIN_NAME PTE7                      /*!<@brief Pin name */
#define BOARD_INITPINS_U_Led_Debug_2_LABEL "U_Led_Debug_2"              /*!<@brief Label */
#define BOARD_INITPINS_U_Led_Debug_2_NAME "U_Led_Debug_2"               /*!<@brief Identifier name */
#define BOARD_INITPINS_U_Led_Debug_2_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                        /* @} */

/*! @name PTB7 (number 9), U_Water_Sensor
  @{ */
#define BOARD_INITPINS_U_Water_Sensor_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_U_Water_Sensor_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_U_Water_Sensor_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_U_Water_Sensor_GPIO_PIN 15U                      /*!<@brief PORTA pin index: 15 */
#define BOARD_INITPINS_U_Water_Sensor_PORT PORTB                        /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_U_Water_Sensor_PIN 7U                            /*!<@brief PORTB pin index: 7 */
#define BOARD_INITPINS_U_Water_Sensor_CHANNEL 15                        /*!<@brief GPIOA GPIO channel: 15 */
#define BOARD_INITPINS_U_Water_Sensor_PIN_NAME PTB7                     /*!<@brief Pin name */
#define BOARD_INITPINS_U_Water_Sensor_LABEL "U_Water_Sensor"            /*!<@brief Label */
#define BOARD_INITPINS_U_Water_Sensor_NAME "U_Water_Sensor"             /*!<@brief Identifier name */
#define BOARD_INITPINS_U_Water_Sensor_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                        /* @} */

/*! @name PTB6 (number 10), U_Heater
  @{ */
#define BOARD_INITPINS_U_Heater_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_U_Heater_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_U_Heater_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_U_Heater_GPIO_PIN 14U                       /*!<@brief PORTA pin index: 14 */
#define BOARD_INITPINS_U_Heater_PORT PORTB                         /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_U_Heater_PIN 6U                             /*!<@brief PORTB pin index: 6 */
#define BOARD_INITPINS_U_Heater_CHANNEL 14                         /*!<@brief GPIOA GPIO channel: 14 */
#define BOARD_INITPINS_U_Heater_PIN_NAME PTB6                      /*!<@brief Pin name */
#define BOARD_INITPINS_U_Heater_LABEL "U_Heater"                   /*!<@brief Label */
#define BOARD_INITPINS_U_Heater_NAME "U_Heater"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_U_Heater_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                   /* @} */

/*! @name PTB5 (number 12), U_Voltage_Config
  @{ */
#define BOARD_INITPINS_U_Voltage_Config_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_U_Voltage_Config_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_U_Voltage_Config_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_U_Voltage_Config_GPIO_PIN 13U                      /*!<@brief PORTA pin index: 13 */
#define BOARD_INITPINS_U_Voltage_Config_PORT PORTB                        /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_U_Voltage_Config_PIN 5U                            /*!<@brief PORTB pin index: 5 */
#define BOARD_INITPINS_U_Voltage_Config_CHANNEL 13                        /*!<@brief GPIOA GPIO channel: 13 */
#define BOARD_INITPINS_U_Voltage_Config_PIN_NAME PTB5                     /*!<@brief Pin name */
#define BOARD_INITPINS_U_Voltage_Config_LABEL "U_Voltage_Config"          /*!<@brief Label */
#define BOARD_INITPINS_U_Voltage_Config_NAME "U_Voltage_Config"           /*!<@brief Identifier name */
#define BOARD_INITPINS_U_Voltage_Config_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                          /* @} */

/*! @name PTB4 (number 13), U_Pump
  @{ */
#define BOARD_INITPINS_U_Pump_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_U_Pump_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_U_Pump_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_U_Pump_GPIO_PIN 12U                       /*!<@brief PORTA pin index: 12 */
#define BOARD_INITPINS_U_Pump_PORT PORTB                         /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_U_Pump_PIN 4U                             /*!<@brief PORTB pin index: 4 */
#define BOARD_INITPINS_U_Pump_CHANNEL 12                         /*!<@brief GPIOA GPIO channel: 12 */
#define BOARD_INITPINS_U_Pump_PIN_NAME PTB4                      /*!<@brief Pin name */
#define BOARD_INITPINS_U_Pump_LABEL "U_Pump"                     /*!<@brief Label */
#define BOARD_INITPINS_U_Pump_NAME "U_Pump"                      /*!<@brief Identifier name */
#define BOARD_INITPINS_U_Pump_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                 /* @} */

/*! @name PTC3 (number 14), U_MS_BU_Present
  @{ */
#define BOARD_INITPINS_U_MS_BU_Present_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_U_MS_BU_Present_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_U_MS_BU_Present_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_U_MS_BU_Present_GPIO_PIN 19U                      /*!<@brief PORTA pin index: 19 */
#define BOARD_INITPINS_U_MS_BU_Present_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_U_MS_BU_Present_PIN 3U                            /*!<@brief PORTC pin index: 3 */
#define BOARD_INITPINS_U_MS_BU_Present_CHANNEL 19                        /*!<@brief GPIOA GPIO channel: 19 */
#define BOARD_INITPINS_U_MS_BU_Present_PIN_NAME PTC3                     /*!<@brief Pin name */
#define BOARD_INITPINS_U_MS_BU_Present_LABEL "U_MS_BU_Present"           /*!<@brief Label */
#define BOARD_INITPINS_U_MS_BU_Present_NAME "U_MS_BU_Present"            /*!<@brief Identifier name */
#define BOARD_INITPINS_U_MS_BU_Present_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                         /* @} */

/*! @name PTC2 (number 15), U_BU_Home_Work
  @{ */
#define BOARD_INITPINS_U_BU_Home_Work_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_U_BU_Home_Work_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_U_BU_Home_Work_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_U_BU_Home_Work_GPIO_PIN 18U                      /*!<@brief PORTA pin index: 18 */
#define BOARD_INITPINS_U_BU_Home_Work_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_U_BU_Home_Work_PIN 2U                            /*!<@brief PORTC pin index: 2 */
#define BOARD_INITPINS_U_BU_Home_Work_CHANNEL 18                        /*!<@brief GPIOA GPIO channel: 18 */
#define BOARD_INITPINS_U_BU_Home_Work_PIN_NAME PTC2                     /*!<@brief Pin name */
#define BOARD_INITPINS_U_BU_Home_Work_LABEL "U_BU_Home_Work"            /*!<@brief Label */
#define BOARD_INITPINS_U_BU_Home_Work_NAME "U_BU_Home_Work"             /*!<@brief Identifier name */
#define BOARD_INITPINS_U_BU_Home_Work_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                        /* @} */

/*! @name PTD7 (number 16), U_Led_Debug
  @{ */
#define BOARD_INITPINS_U_Led_Debug_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_U_Led_Debug_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_U_Led_Debug_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_U_Led_Debug_GPIO_PIN 31U                       /*!<@brief PORTA pin index: 31 */
#define BOARD_INITPINS_U_Led_Debug_PORT PORTD                         /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_U_Led_Debug_PIN 7U                             /*!<@brief PORTD pin index: 7 */
#define BOARD_INITPINS_U_Led_Debug_CHANNEL 31                         /*!<@brief GPIOA GPIO channel: 31 */
#define BOARD_INITPINS_U_Led_Debug_PIN_NAME PTD7                      /*!<@brief Pin name */
#define BOARD_INITPINS_U_Led_Debug_LABEL "U_Led_Debug"                /*!<@brief Label */
#define BOARD_INITPINS_U_Led_Debug_NAME "U_Led_Debug"                 /*!<@brief Identifier name */
#define BOARD_INITPINS_U_Led_Debug_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                      /* @} */

/*! @name PTD6 (number 17), U_BU_Fault
  @{ */
#define BOARD_INITPINS_U_BU_Fault_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_U_BU_Fault_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_U_BU_Fault_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_U_BU_Fault_GPIO_PIN 30U                      /*!<@brief PORTA pin index: 30 */
#define BOARD_INITPINS_U_BU_Fault_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_U_BU_Fault_PIN 6U                            /*!<@brief PORTD pin index: 6 */
#define BOARD_INITPINS_U_BU_Fault_CHANNEL 30                        /*!<@brief GPIOA GPIO channel: 30 */
#define BOARD_INITPINS_U_BU_Fault_PIN_NAME PTD6                     /*!<@brief Pin name */
#define BOARD_INITPINS_U_BU_Fault_LABEL "U_BU_Fault"                /*!<@brief Label */
#define BOARD_INITPINS_U_BU_Fault_NAME "U_BU_Fault"                 /*!<@brief Identifier name */
#define BOARD_INITPINS_U_BU_Fault_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                    /* @} */

/*! @name KBI1_P5 (number 18), U_Flowmeter_Pulse
  @{ */
#define BOARD_INITPINS_U_Flowmeter_Pulse_PERIPHERAL KBI1                   /*!<@brief Device name: KBI1 */
#define BOARD_INITPINS_U_Flowmeter_Pulse_SIGNAL P                          /*!<@brief KBI1 signal: P */
#define BOARD_INITPINS_U_Flowmeter_Pulse_CHANNEL 5                         /*!<@brief KBI1 P channel: 5 */
#define BOARD_INITPINS_U_Flowmeter_Pulse_PIN_NAME KBI1_P5                  /*!<@brief Pin name */
#define BOARD_INITPINS_U_Flowmeter_Pulse_LABEL "U_Flowmeter_Pulse"         /*!<@brief Label */
#define BOARD_INITPINS_U_Flowmeter_Pulse_NAME "U_Flowmeter_Pulse"          /*!<@brief Identifier name */
#define BOARD_INITPINS_U_Flowmeter_Pulse_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                           /* @} */

/*! @name PTC1 (number 19), U_BU_Rev
  @{ */
#define BOARD_INITPINS_U_BU_Rev_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_U_BU_Rev_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_U_BU_Rev_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_U_BU_Rev_GPIO_PIN 17U                       /*!<@brief PORTA pin index: 17 */
#define BOARD_INITPINS_U_BU_Rev_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_U_BU_Rev_PIN 1U                             /*!<@brief PORTC pin index: 1 */
#define BOARD_INITPINS_U_BU_Rev_CHANNEL 17                         /*!<@brief GPIOA GPIO channel: 17 */
#define BOARD_INITPINS_U_BU_Rev_PIN_NAME PTC1                      /*!<@brief Pin name */
#define BOARD_INITPINS_U_BU_Rev_LABEL "U_BU_Rev"                   /*!<@brief Label */
#define BOARD_INITPINS_U_BU_Rev_NAME "U_BU_Rev"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_U_BU_Rev_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                   /* @} */

