riccardoziani/mke02/board/pin_mux.h
/*! @name PTC0 (number 20), U_BU_Fwd
  @{ */
#define BOARD_INITPINS_U_BU_Fwd_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_U_BU_Fwd_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_U_BU_Fwd_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_U_BU_Fwd_GPIO_PIN 16U                       /*!<@brief PORTA pin index: 16 */
#define BOARD_INITPINS_U_BU_Fwd_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_U_BU_Fwd_PIN 0U                             /*!<@brief PORTC pin index: 0 */
#define BOARD_INITPINS_U_BU_Fwd_CHANNEL 16                         /*!<@brief GPIOA GPIO channel: 16 */
#define BOARD_INITPINS_U_BU_Fwd_PIN_NAME PTC0                      /*!<@brief Pin name */
#define BOARD_INITPINS_U_BU_Fwd_LABEL "U_BU_Fwd"                   /*!<@brief Label */
#define BOARD_INITPINS_U_BU_Fwd_NAME "U_BU_Fwd"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_U_BU_Fwd_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                   /* @} */

/*! @name PTB3 (number 21), Tp1
  @{ */
#define BOARD_INITPINS_Tp1_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_Tp1_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_Tp1_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_Tp1_GPIO_PIN 11U                       /*!<@brief PORTA pin index: 11 */
#define BOARD_INITPINS_Tp1_PORT PORTB                         /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_Tp1_PIN 3U                             /*!<@brief PORTB pin index: 3 */
#define BOARD_INITPINS_Tp1_CHANNEL 11                         /*!<@brief GPIOA GPIO channel: 11 */
#define BOARD_INITPINS_Tp1_PIN_NAME PTB3                      /*!<@brief Pin name */
#define BOARD_INITPINS_Tp1_LABEL "Tp1"                        /*!<@brief Label */
#define BOARD_INITPINS_Tp1_NAME "Tp1"                         /*!<@brief Identifier name */
#define BOARD_INITPINS_Tp1_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                              /* @} */

/*! @name FTM0_CH0 (number 22), U_Valve_1
  @{ */
#define BOARD_INITPINS_U_Valve_1_PERIPHERAL FTM0                    /*!<@brief Device name: FTM0 */
#define BOARD_INITPINS_U_Valve_1_SIGNAL CH                          /*!<@brief FTM0 signal: CH */
#define BOARD_INITPINS_U_Valve_1_CHANNEL 0                          /*!<@brief FTM0 channel: 0 */
#define BOARD_INITPINS_U_Valve_1_PIN_NAME FTM0_CH0                  /*!<@brief Pin name */
#define BOARD_INITPINS_U_Valve_1_LABEL "U_Valve_1"                  /*!<@brief Label */
#define BOARD_INITPINS_U_Valve_1_NAME "U_Valve_1"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_U_Valve_1_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                    /* @} */

/*! @name ADC0_SE5 (number 23), U_BU_Current
  @{ */
#define BOARD_INITPINS_U_BU_Current_PERIPHERAL ADC       /*!<@brief Device name: ADC */
#define BOARD_INITPINS_U_BU_Current_SIGNAL SE            /*!<@brief ADC signal: SE */
#define BOARD_INITPINS_U_BU_Current_CHANNEL 5            /*!<@brief ADC SE channel: 5 */
#define BOARD_INITPINS_U_BU_Current_PIN_NAME ADC0_SE5    /*!<@brief Pin name */
#define BOARD_INITPINS_U_BU_Current_LABEL "U_BU_Current" /*!<@brief Label */
#define BOARD_INITPINS_U_BU_Current_NAME "U_BU_Current"  /*!<@brief Identifier name */
                                                         /* @} */

/*! @name ADC0_SE4 (number 24), U_NTC_Boiler
  @{ */
#define BOARD_INITPINS_U_NTC_Boiler_PERIPHERAL ADC       /*!<@brief Device name: ADC */
#define BOARD_INITPINS_U_NTC_Boiler_SIGNAL SE            /*!<@brief ADC signal: SE */
#define BOARD_INITPINS_U_NTC_Boiler_CHANNEL 4            /*!<@brief ADC SE channel: 4 */
#define BOARD_INITPINS_U_NTC_Boiler_PIN_NAME ADC0_SE4    /*!<@brief Pin name */
#define BOARD_INITPINS_U_NTC_Boiler_LABEL "U_NTC_Boiler" /*!<@brief Label */
#define BOARD_INITPINS_U_NTC_Boiler_NAME "U_NTC_Boiler"  /*!<@brief Identifier name */
                                                         /* @} */

/*! @name PTA7 (number 25), U_Power_Cut
  @{ */
#define BOARD_INITPINS_U_Power_Cut_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_U_Power_Cut_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_U_Power_Cut_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_U_Power_Cut_GPIO_PIN 7U                        /*!<@brief PORTA pin index: 7 */
#define BOARD_INITPINS_U_Power_Cut_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_U_Power_Cut_PIN 7U                             /*!<@brief PORTA pin index: 7 */
#define BOARD_INITPINS_U_Power_Cut_CHANNEL 7                          /*!<@brief GPIOA GPIO channel: 7 */
#define BOARD_INITPINS_U_Power_Cut_PIN_NAME PTA7                      /*!<@brief Pin name */
#define BOARD_INITPINS_U_Power_Cut_LABEL "U_Power_Cut"                /*!<@brief Label */
#define BOARD_INITPINS_U_Power_Cut_NAME "U_Power_Cut"                 /*!<@brief Identifier name */
#define BOARD_INITPINS_U_Power_Cut_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                      /* @} */

/*! @name PTA6 (number 26), U_BU_Dreg_Door
  @{ */
#define BOARD_INITPINS_U_BU_Dreg_Door_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_U_BU_Dreg_Door_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_U_BU_Dreg_Door_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_U_BU_Dreg_Door_GPIO_PIN 6U                       /*!<@brief PORTA pin index: 6 */
#define BOARD_INITPINS_U_BU_Dreg_Door_PORT PORTA                        /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_U_BU_Dreg_Door_PIN 6U                            /*!<@brief PORTA pin index: 6 */
#define BOARD_INITPINS_U_BU_Dreg_Door_CHANNEL 6                         /*!<@brief GPIOA GPIO channel: 6 */
#define BOARD_INITPINS_U_BU_Dreg_Door_PIN_NAME PTA6                     /*!<@brief Pin name */
#define BOARD_INITPINS_U_BU_Dreg_Door_LABEL "U_BU_Dreg_Door"            /*!<@brief Label */
#define BOARD_INITPINS_U_BU_Dreg_Door_NAME "U_BU_Dreg_Door"             /*!<@brief Identifier name */
#define BOARD_INITPINS_U_BU_Dreg_Door_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                        /* @} */

/*! @name PTD4 (number 29), TP2
  @{ */
#define BOARD_INITPINS_TP2_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_TP2_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_TP2_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_TP2_GPIO_PIN 28U                       /*!<@brief PORTA pin index: 28 */
#define BOARD_INITPINS_TP2_PORT PORTD                         /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_TP2_PIN 4U                             /*!<@brief PORTD pin index: 4 */
#define BOARD_INITPINS_TP2_CHANNEL 28                         /*!<@brief GPIOA GPIO channel: 28 */
#define BOARD_INITPINS_TP2_PIN_NAME PTD4                      /*!<@brief Pin name */
#define BOARD_INITPINS_TP2_LABEL "TP2"                        /*!<@brief Label */
#define BOARD_INITPINS_TP2_NAME "TP2"                         /*!<@brief Identifier name */
#define BOARD_INITPINS_TP2_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                              /* @} */

/*! @name PTD3 (number 30), TP3
  @{ */
#define BOARD_INITPINS_TP3_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_TP3_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_TP3_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_TP3_GPIO_PIN 27U                       /*!<@brief PORTA pin index: 27 */
#define BOARD_INITPINS_TP3_PORT PORTD                         /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_TP3_PIN 3U                             /*!<@brief PORTD pin index: 3 */
#define BOARD_INITPINS_TP3_CHANNEL 27                         /*!<@brief GPIOA GPIO channel: 27 */
#define BOARD_INITPINS_TP3_PIN_NAME PTD3                      /*!<@brief Pin name */
#define BOARD_INITPINS_TP3_LABEL "TP3"                        /*!<@brief Label */
#define BOARD_INITPINS_TP3_NAME "TP3"                         /*!<@brief Identifier name */
#define BOARD_INITPINS_TP3_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                              /* @} */

/*! @name PTD2 (number 31), U_Config_1
  @{ */
#define BOARD_INITPINS_U_Config_1_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_U_Config_1_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_U_Config_1_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_U_Config_1_GPIO_PIN 26U                      /*!<@brief PORTA pin index: 26 */
#define BOARD_INITPINS_U_Config_1_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_U_Config_1_PIN 2U                            /*!<@brief PORTD pin index: 2 */
#define BOARD_INITPINS_U_Config_1_CHANNEL 26                        /*!<@brief GPIOA GPIO channel: 26 */
#define BOARD_INITPINS_U_Config_1_PIN_NAME PTD2                     /*!<@brief Pin name */
#define BOARD_INITPINS_U_Config_1_LABEL "U_Config_1"                /*!<@brief Label */
#define BOARD_INITPINS_U_Config_1_NAME "U_Config_1"                 /*!<@brief Identifier name */
#define BOARD_INITPINS_U_Config_1_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                    /* @} */

