riccardoziani/mke02/board/pin_mux.h
/*! @name UART0_TX (number 32), TX_Uart_Lin
  @{ */
#define BOARD_INITPINS_TX_Uart_Lin_PERIPHERAL UART0    /*!<@brief Device name: UART0 */
#define BOARD_INITPINS_TX_Uart_Lin_SIGNAL TX           /*!<@brief UART0 signal: TX */
#define BOARD_INITPINS_TX_Uart_Lin_PIN_NAME UART0_TX   /*!<@brief Pin name */
#define BOARD_INITPINS_TX_Uart_Lin_LABEL "TX_Uart_Lin" /*!<@brief Label */
#define BOARD_INITPINS_TX_Uart_Lin_NAME "TX_Uart_Lin"  /*!<@brief Identifier name */
                                                       /* @} */

/*! @name UART0_RX (number 33), RX_Uart_Lin
  @{ */
#define BOARD_INITPINS_RX_Uart_Lin_PERIPHERAL UART0    /*!<@brief Device name: UART0 */
#define BOARD_INITPINS_RX_Uart_Lin_SIGNAL RX           /*!<@brief UART0 signal: RX */
#define BOARD_INITPINS_RX_Uart_Lin_PIN_NAME UART0_RX   /*!<@brief Pin name */
#define BOARD_INITPINS_RX_Uart_Lin_LABEL "RX_Uart_Lin" /*!<@brief Label */
#define BOARD_INITPINS_RX_Uart_Lin_NAME "RX_Uart_Lin"  /*!<@brief Identifier name */
                                                       /* @} */

/*! @name UART1_TX (number 36), TX_Uart_Aux
  @{ */
#define BOARD_INITPINS_TX_Uart_Aux_PERIPHERAL UART1    /*!<@brief Device name: UART1 */
#define BOARD_INITPINS_TX_Uart_Aux_SIGNAL TX           /*!<@brief UART1 signal: TX */
#define BOARD_INITPINS_TX_Uart_Aux_PIN_NAME UART1_TX   /*!<@brief Pin name */
#define BOARD_INITPINS_TX_Uart_Aux_LABEL "TX_Uart_Aux" /*!<@brief Label */
#define BOARD_INITPINS_TX_Uart_Aux_NAME "TX_Uart_Aux"  /*!<@brief Identifier name */
                                                       /* @} */

/*! @name UART1_RX (number 37), RX_Uart_Aux
  @{ */
#define BOARD_INITPINS_RX_Uart_Aux_PERIPHERAL UART1    /*!<@brief Device name: UART1 */
#define BOARD_INITPINS_RX_Uart_Aux_SIGNAL RX           /*!<@brief UART1 signal: RX */
#define BOARD_INITPINS_RX_Uart_Aux_PIN_NAME UART1_RX   /*!<@brief Pin name */
#define BOARD_INITPINS_RX_Uart_Aux_LABEL "RX_Uart_Aux" /*!<@brief Label */
#define BOARD_INITPINS_RX_Uart_Aux_NAME "RX_Uart_Aux"  /*!<@brief Identifier name */
                                                       /* @} */

/*! @name PTE2 (number 38), UI_Busy
  @{ */
#define BOARD_INITPINS_UI_Busy_PERIPHERAL GPIOB                  /*!<@brief Device name: GPIOB */
#define BOARD_INITPINS_UI_Busy_SIGNAL GPIO                       /*!<@brief GPIOB signal: GPIO */
#define BOARD_INITPINS_UI_Busy_GPIO GPIOB                        /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_UI_Busy_GPIO_PIN 2U                       /*!<@brief PORTB pin index: 2 */
#define BOARD_INITPINS_UI_Busy_PORT PORTE                        /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_UI_Busy_PIN 2U                            /*!<@brief PORTE pin index: 2 */
#define BOARD_INITPINS_UI_Busy_CHANNEL 2                         /*!<@brief GPIOB GPIO channel: 2 */
#define BOARD_INITPINS_UI_Busy_PIN_NAME PTE2                     /*!<@brief Pin name */
#define BOARD_INITPINS_UI_Busy_LABEL "UI_Busy"                   /*!<@brief Label */
#define BOARD_INITPINS_UI_Busy_NAME "UI_Busy"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_UI_Busy_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                 /* @} */

/*! @name PTE1 (number 39), Tp4
  @{ */
#define BOARD_INITPINS_Tp4_PERIPHERAL GPIOB                   /*!<@brief Device name: GPIOB */
#define BOARD_INITPINS_Tp4_SIGNAL GPIO                        /*!<@brief GPIOB signal: GPIO */
#define BOARD_INITPINS_Tp4_GPIO GPIOB                         /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_Tp4_GPIO_PIN 1U                        /*!<@brief PORTB pin index: 1 */
#define BOARD_INITPINS_Tp4_PORT PORTE                         /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_Tp4_PIN 1U                             /*!<@brief PORTE pin index: 1 */
#define BOARD_INITPINS_Tp4_CHANNEL 1                          /*!<@brief GPIOB GPIO channel: 1 */
#define BOARD_INITPINS_Tp4_PIN_NAME PTE1                      /*!<@brief Pin name */
#define BOARD_INITPINS_Tp4_LABEL "Tp4"                        /*!<@brief Label */
#define BOARD_INITPINS_Tp4_NAME "Tp4"                         /*!<@brief Identifier name */
#define BOARD_INITPINS_Tp4_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                              /* @} */

/*! @name PTE0 (number 40), U_Grinder
  @{ */
#define BOARD_INITPINS_U_Grinder_PERIPHERAL GPIOB                   /*!<@brief Device name: GPIOB */
#define BOARD_INITPINS_U_Grinder_SIGNAL GPIO                        /*!<@brief GPIOB signal: GPIO */
#define BOARD_INITPINS_U_Grinder_GPIO GPIOB                         /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_U_Grinder_GPIO_PIN 0U                        /*!<@brief PORTB pin index: 0 */
#define BOARD_INITPINS_U_Grinder_PORT PORTE                         /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_U_Grinder_PIN 0U                             /*!<@brief PORTE pin index: 0 */
#define BOARD_INITPINS_U_Grinder_CHANNEL 0                          /*!<@brief GPIOB GPIO channel: 0 */
#define BOARD_INITPINS_U_Grinder_PIN_NAME PTE0                      /*!<@brief Pin name */
#define BOARD_INITPINS_U_Grinder_LABEL "U_Grinder"                  /*!<@brief Label */
#define BOARD_INITPINS_U_Grinder_NAME "U_Grinder"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_U_Grinder_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                    /* @} */

/*! @name PTC5 (number 41), Tp5
  @{ */
#define BOARD_INITPINS_Tp5_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_Tp5_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_Tp5_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_Tp5_GPIO_PIN 21U                       /*!<@brief PORTA pin index: 21 */
#define BOARD_INITPINS_Tp5_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_Tp5_PIN 5U                             /*!<@brief PORTC pin index: 5 */
#define BOARD_INITPINS_Tp5_CHANNEL 21                         /*!<@brief GPIOA GPIO channel: 21 */
#define BOARD_INITPINS_Tp5_PIN_NAME PTC5                      /*!<@brief Pin name */
#define BOARD_INITPINS_Tp5_LABEL "Tp5"                        /*!<@brief Label */
#define BOARD_INITPINS_Tp5_NAME "Tp5"                         /*!<@brief Identifier name */
#define BOARD_INITPINS_Tp5_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                              /* @} */

