riccardoziani/mke02/board/pin_mux.h
/*! @name RESET (number 43), Mcu_Ext_Reset
  @{ */
#define BOARD_INITPINS_Mcu_Ext_Reset_PERIPHERAL SystemControl          /*!<@brief Device name: SystemControl */
#define BOARD_INITPINS_Mcu_Ext_Reset_SIGNAL RESET                      /*!<@brief SystemControl signal: RESET */
#define BOARD_INITPINS_Mcu_Ext_Reset_PIN_NAME RESET                    /*!<@brief Pin name */
#define BOARD_INITPINS_Mcu_Ext_Reset_LABEL "Mcu_Ext_Reset"             /*!<@brief Label */
#define BOARD_INITPINS_Mcu_Ext_Reset_NAME "Mcu_Ext_Reset"              /*!<@brief Identifier name */
#define BOARD_INITPINS_Mcu_Ext_Reset_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                       /* @} */

/*! @name FTM1_CH0 (number 4), U_Buzzer
  @{ */
#define BOARD_INITPINS_U_Buzzer_PERIPHERAL FTM1                    /*!<@brief Device name: FTM1 */
#define BOARD_INITPINS_U_Buzzer_SIGNAL CH                          /*!<@brief FTM1 signal: CH */
#define BOARD_INITPINS_U_Buzzer_CHANNEL 0                          /*!<@brief FTM1 channel: 0 */
#define BOARD_INITPINS_U_Buzzer_PIN_NAME FTM1_CH0                  /*!<@brief Pin name */
#define BOARD_INITPINS_U_Buzzer_LABEL "U_Buzzer"                   /*!<@brief Label */
#define BOARD_INITPINS_U_Buzzer_NAME "U_Buzzer"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_U_Buzzer_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                   /* @} */

/*! @name PTC4 (number 42), SWD_CLK
  @{ */
#define BOARD_INITPINS_SWD_CLK_PERIPHERAL GPIOA /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_SWD_CLK_SIGNAL GPIO      /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_SWD_CLK_GPIO GPIOA       /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_SWD_CLK_GPIO_PIN 20U     /*!<@brief PORTA pin index: 20 */
#define BOARD_INITPINS_SWD_CLK_PORT PORTC       /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_SWD_CLK_PIN 4U           /*!<@brief PORTC pin index: 4 */
#define BOARD_INITPINS_SWD_CLK_CHANNEL 20       /*!<@brief GPIOA GPIO channel: 20 */
#define BOARD_INITPINS_SWD_CLK_PIN_NAME PTC4    /*!<@brief Pin name */
#define BOARD_INITPINS_SWD_CLK_LABEL "SWD_CLK"  /*!<@brief Label */
#define BOARD_INITPINS_SWD_CLK_NAME "SWD_CLK"   /*!<@brief Identifier name */
                                                /* @} */

/*! @name ADC0_SE0 (number 35), U_Grinder_Analog
  @{ */
#define BOARD_INITPINS_U_Grinder_Analog_PERIPHERAL ADC           /*!<@brief Device name: ADC */
#define BOARD_INITPINS_U_Grinder_Analog_SIGNAL SE                /*!<@brief ADC signal: SE */
#define BOARD_INITPINS_U_Grinder_Analog_CHANNEL 0                /*!<@brief ADC SE channel: 0 */
#define BOARD_INITPINS_U_Grinder_Analog_PIN_NAME ADC0_SE0        /*!<@brief Pin name */
#define BOARD_INITPINS_U_Grinder_Analog_LABEL "U_Grinder_Analog" /*!<@brief Label */
#define BOARD_INITPINS_U_Grinder_Analog_NAME "U_Grinder_Analog"  /*!<@brief Identifier name */
                                                                 /* @} */

/*! @name KBI0_P1 (number 34), U_Grinder_Sensor
  @{ */
#define BOARD_INITPINS_U_Grinder_Sensor_PERIPHERAL KBI0                   /*!<@brief Device name: KBI0 */
#define BOARD_INITPINS_U_Grinder_Sensor_SIGNAL P                          /*!<@brief KBI0 signal: P */
#define BOARD_INITPINS_U_Grinder_Sensor_CHANNEL 1                         /*!<@brief KBI0 P channel: 1 */
#define BOARD_INITPINS_U_Grinder_Sensor_PIN_NAME KBI0_P1                  /*!<@brief Pin name */
#define BOARD_INITPINS_U_Grinder_Sensor_LABEL "U_Grinder_Sensor"          /*!<@brief Label */
#define BOARD_INITPINS_U_Grinder_Sensor_NAME "U_Grinder_Sensor"           /*!<@brief Identifier name */
#define BOARD_INITPINS_U_Grinder_Sensor_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
